{
  "page": {
    "home": "Home"
  },
  "problem-type": {
    "hash-table": "Hash Table",
    "math": "Math",
    "dynamic-programming": "DP",
    "linked-list": "Linked List",
    "two-pointers": "Two Pointers",
    "binary-tree": "Binary Tree"
  },
  "difficulty": {
    "easy": "Easy",
    "medium": "Medium",
    "hard": "Hard"
  },
  "problem": {
    "1": {
      "title": "Two Sum",
      "description": "Given an array of integers nums and an integer target, return indices of the two numbers such that they add up to target.\nYou may assume that each input would have exactly one solution, and you may not use the same element twice.\nYou can return the answer in any order."
    },
    "9": {
      "title": "Palindrome Number",
      "description": "Given an integer x, return true if x is palindrome integer.\nAn integer is a palindrome when it reads the same backward as forward."
    },
    "13": {
      "title": "Roman to Integer",
      "description": "Roman numerals are represented by seven different symbols: I, V, X, L, C, D and M."
    },
    "70": {
      "title": "Climbing Stairs",
      "description": "You are climbing a staircase. It takes n steps to reach the top.\nEach time you can either climb 1 or 2 steps. In how many distinct ways can you climb to the top?"
    },
    "83": {
      "title": "Remove Duplicates from Sorted List",
      "description": "Given the head of a sorted linked list, delete all duplicates such that each element appears only once. Return the linked list sorted as well."
    },
    "88": {
      "title": "Merge Sorted Array",
      "description": "You are given two integer arrays nums1 and nums2, sorted in non-decreasing order, and two integers m and n, representing the number of elements in nums1 and nums2 respectively.\n\nMerge nums1 and nums2 into a single array sorted in non-decreasing order.\n\nThe final sorted array should not be returned by the function, but instead be stored inside the array nums1. To accommodate this, nums1 has a length of m + n, where the first m elements denote the elements that should be merged, and the last n elements are set to 0 and should be ignored. nums2 has a length of n."
    },
    "94": {
      "title": "Binary Tree Inorder Traversal",
      "description": "Given the root of a binary tree, return the inorder traversal of its nodes' values."
    },
    "100": {
      "title": "Same Tree",
      "description": "Given the roots of two binary trees p and q, write a function to check if they are the same or not.\nTwo binary trees are considered the same if they are structurally identical, and the nodes have the same value."
    }
  },
  "example": "Example",
  "customized": "Customized",
  "action": {
    "next": "Next",
    "restart": "Restart"
  }
}
